{
    "id": "SumRndmDde.SuperMessageEditor",
    "organization": "SumRndmDde",
    "name": "Super Message Editor",
    "version": "1.0.0.1",
    "author": "Robert Borghese",
    "website": "http://sumrndm.site/",
    "description": "============================================\nSuper Message Editor  -  v1.0.0.1\n\nby SumRndmDde\n============================================\n\nThis is extension provides developers the ability to use a \"wysiwyg\" style text editor for creating Show Message commands.\n\nThe way it works is the extension adds a command called \"Show Message (Editor)\". This command is identical to the \"Show Message\" command. The only difference is there is now a new input for opening the editor. Simply click on \"Message Editor\" and then \"Open Editor\".\n\nUpon opening the editor, any existing text will be loaded in. Compatible message codes will be translated to their proper effects while other text codes will remain unchanged. Once the user edits their message, they may simply close the window. The new text will be converted back into VNM message codes and placed into the command text box. Be sure to click the command box to view the updated changes!\n\n\nHere are all the compatible effects:\n\nBold, Italic, Underline, Strike-out, Text Size, Text Color (uses custom color codes!), Outline Color (uses custom colors also!) \n\n\nFinally, the editor also provides find, replace, and special paste functions to help with some of those special moments when you need to find, replace, or... special paste something...\n\n\nWelp, that's all for now. Bye! ~",
    "license": "= = = = = = Terms of Use = = = = = =\n\nUp to date terms can be found here: http://sumrndm.site/vnm-terms-of-use/\n\n– These Extensions may be used in free or commercial games.\n– “SumRndmDde” must be given credit and this website must also be linked.\n– You are allowed to edit the Extension code for your own use. If you wish to redistribute edits, please do so by creating a child Extension.\n– Please do not modify the comments at the top of the source files.\n– The author, description, license, and other information bound to the Extension may not be changed.\n– You are NOT allowed to redistribute these Extensions.\n– You may NOT take code for your own released Extensions without credit.\n– If I see your game uses one of my Extensions and I shamelessly ask for a free copy, please do not judge me too much 😀\n\n= = = = = = Other Licensing Info = = = = = =\n\nThis extension uses CKEditor, which is licensed under GPL. More information can be found here:\nhttps://ckeditor.com/legal/ckeditor-oss-license/"
}